omkarsangrulkar/FOTA_GSM/STM32_M66/Core/Src/M66.c
}

const char* mqtt_broker = "a2lrvn2efyqxdn-ats.iot.us-east-1.amazonaws.com";
const char* client_id = "M66";
const char* topic = "$aws/things/M66/shadow";
void AWS_MQTT(void){


//	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QMTOPEN=0,\"a2lrvn2efyqxdn-ats.iot.us-east-1.amazonaws.com\",8883\r\n",74 , 1000);
	char mqtt_open_command[128];
	sprintf(mqtt_open_command, "AT+QMTOPEN=0,\"%s\",8883", mqtt_broker);
	send_at_command(mqtt_open_command,"+QMTOPEN: 0,0");
    while (check_at_command_response(LONG_DELAY) == AT_WAITING_RESPONSE);
    if(at_state != AT_RESPONSE_RECEIVED)
    {
        return;
    }
//	UART_Send(mqtt_open_command);
//	HAL_Delay(LONG_DELAY);
//	send_at_command("AT+QMTOPEN=0,\"%s\",1883\r\n", mqtt_broker);
//	send_at_command("AT+QMTCONN=0,\"%s\"\r\n", client_id);
	char mqtt_conn_command[128];
	sprintf(mqtt_conn_command, "AT+QMTCONN=0,\"%s\"", client_id);
	send_at_command(mqtt_conn_command, "+QMTCONN: 0,0,0");
    while (check_at_command_response(DELAY) == AT_WAITING_RESPONSE);
    if(at_state != AT_RESPONSE_RECEIVED)
    {
        return;
    }
//    UART_Send(mqtt_conn_command);

    at_state = AT_IDLE;
	char mqtt_sub_command[128];
	sprintf(mqtt_sub_command, "AT+QMTSUB=0,1,\"%s\",1", topic);
	send_at_command(mqtt_sub_command, "+QMTSUB: 0,1,0,1");
    while (check_at_command_response(DELAY) == AT_WAITING_RESPONSE);
    if(at_state != AT_RESPONSE_RECEIVED)
    {
        return;
    }
//	UART_Send(mqtt_sub_command);
    current_mode = MODE_MQTT;
}


//AT+QMTOPEN=0,"a2lrvn2efyqxdn-ats.iot.us-east-1.amazonaws.com",8883

uint32_t receive_data(uint8_t* buffer, uint32_t buffer_size){
    uint32_t bytes_read = 0;
    uint32_t last_data_time = HAL_GetTick(); // Initialize with current tick

    DISABLE_UART_INTERRUPT();

    while (bytes_read < buffer_size) {
        if ((HAL_GetTick() - last_data_time) > UART_TIMEOUT) {
            break;  // Timeout if no new data for a defined duration
        }

        // Only process data if there's new data in the UART buffer
        while (uart_buffer.read_index != uart_buffer.write_index && bytes_read < buffer_size) {
            buffer[bytes_read] = uart_buffer.data[uart_buffer.read_index];
            bytes_read++;
            last_data_time = HAL_GetTick();  // Update the last data time when new data is received

            uart_buffer.read_index++;
            if (uart_buffer.read_index >= UART_BUFFER_SIZE) {
                uart_buffer.read_index = 0;
            }
        }
    }

    ENABLE_UART_INTERRUPT();

    return bytes_read;
}
// Function to receive data from Quectel M66 module
// Updated receive_data function
//uint32_t receive_data(uint8_t* buffer, uint32_t size) {
//
//    size_t bytes_received = 0;
//
//    HAL_StatusTypeDef status = HAL_UART_Receive(&huart2, buffer, size, 10000);
//
//    if (status == HAL_OK) {
//        // UART data received successfully, update the number of bytes received
//        bytes_received = size;
//    }

    // Return the actual number of bytes received
//    return bytes_received;
//}

void handle_default_byte(uint8_t byte) {
	receive_buffer[buffer_idx++] = byte;

	    // Null-terminate the buffer for string functions
	    if (buffer_idx < BUFFER_MAX_SIZE) {
	        receive_buffer[buffer_idx] = '\0';
	    }

	    // Check for end of HTTP response or other markers
	    if (strstr((char*)receive_buffer, "\r\nOK\r\n") != NULL) {
	        firmware_download_complete = true;
	    }

	    // If the buffer is almost full or some other condition arises, you can process or reset
	    if (buffer_idx >= BUFFER_MAX_SIZE - 1) {
	        // TODO: Handle overflow or reset buffer_idx
	        buffer_idx = 0; // Reset as an example
	        memset(receive_buffer, 0, BUFFER_MAX_SIZE); // Clear buffer (if needed)
	    }
}

void handle_mqtt_byte(uint8_t byte) {
    // Append the received byte to the MQTT buffer
    if (mqtt_buffer_idx < MQTT_BUFFER_SIZE - 1) {
        mqtt_buffer[mqtt_buffer_idx++] = byte;
        mqtt_buffer[mqtt_buffer_idx] = '\0'; // Null-terminate for string functions
    } else {
        // Buffer overflow; you can handle it as required, maybe reset the index
        mqtt_buffer_idx = 0;
        return;
    }

    // Check if we have a complete MQTT message, e.g., by looking for }
    if (byte == '}') {
        // Null-terminate the message for safety
        mqtt_buffer[mqtt_buffer_idx] = '\0';

        // Handle the complete MQTT message
        handle_mqtt_message((const char*)mqtt_buffer);

        // Reset the MQTT buffer for the next message
        mqtt_buffer_idx = 0;
    }
}

void handle_mqtt_message(const char* message) {
    const char* json_start = strchr(message, '{'); // Find the first '{' character
    cJSON* root = cJSON_Parse(json_start);

    if (root != NULL) {
        cJSON* messageTypeObj = cJSON_GetObjectItem(root, "message_type");
        cJSON* firmwareUrlObj = cJSON_GetObjectItem(root, "firmware_url");

        if (messageTypeObj != NULL && firmwareUrlObj != NULL) {
            const char* message_type = messageTypeObj->valuestring;
            if (strcmp(message_type, "update_available") == 0) {
                // Copy firmware URL to global variable
                strncpy(firmware_url, firmwareUrlObj->valuestring, MAX_URL_LENGTH - 1);
                firmware_url[MAX_URL_LENGTH - 1] = '\0'; // Null-terminate to ensure it's a valid string

                // Set the state to begin downloading
                current_mode = MODE_DEFAULT;
                fwUpdateState = DOWNLOAD_PENDING;
            }
        }
        cJSON_Delete(root);
    }
}

//// Implement a function to handle MQTT messages. When an update notification is received, extract the firmware URL.
//void handle_mqtt_message(const char* message) {
////    // Parse the MQTT message (assumes it's in JSON format)
////    // Extract the firmware URL from the message
////
////    // Example JSON parsing (for demonstration purposes):
////     char* firmware_url = NULL;
////     char* message_type = NULL;
////
////    // Parse the JSON message to extract firmware_url and message_type
////    // You may need to use a JSON parsing library or write your parser
////    // Example: {"message_type":"update_available","firmware_url":"http://your-fota-server/firmware.bin"}
////    if (sscanf(message, "{\"message_type\":\"%[^\"]\",\"firmware_url\":\"%[^\"]\"}", message_type, firmware_url) == 2) {
////        if (strcmp(message_type, "update_available") == 0) {
////
////        	if(download_firmware(firmware_url));
////
////        }
////    }
//    // Implement logic to handle other message types or errors.
//	const char* json_start = strchr(message, '{'); // Find the first '{' character
//
//	cJSON* root = cJSON_Parse(json_start);
//
//	if (root == NULL) {
//	    const char* error_ptr = cJSON_GetErrorPtr();
//	    if (error_ptr != NULL) {
//	        fprintf(stderr, "JSON parsing error before: %s\n", error_ptr);
//	    }
//	}
//	    if (root != NULL) {
//
//
//	        cJSON* messageTypeObj = cJSON_GetObjectItem(root, "message_type");
//	        cJSON* firmwareUrlObj = cJSON_GetObjectItem(root, "firmware_url");
//
//	        if (messageTypeObj != NULL && firmwareUrlObj != NULL) {
//	            const char* message_type = messageTypeObj->valuestring;
//	            const char* firmware_url = firmwareUrlObj->valuestring;
////	            send_at_command(firmware_url);
//
//	            if (strcmp(message_type, "update_available") == 0) {
//	                            // The message is of type "update_available"
//	                            // You can now use the extracted firmware URL in the 'firmware_url' variable.
//	            	if(download_firmware(firmware_url)){
//	            		if(verify_firmware_update(firmware_buffer, firmware_size)){
//	            			if(write_firmware_to_flash(firmware_buffer, firmware_size)){
//	            				NVIC_SystemReset();
//
//	            			}
//	            		}
//	            	}
//	                        }
//	                    }
//
//	                    // Free the cJSON object when done
//	                    cJSON_Delete(root);
//	                }
//
//
//}

//bool download_firmware(const char* firmware_url) {
//    // Send AT command to set up HTTP connection
////    send_at_command("AT+QHTTPCFG=\"contextid\",1\r\n");
////    send_at_command("AT+QSSLCFG=\"https\",1\r\n");
////    HAL_Delay(1000);
//	HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSSLCFG=\"https\",1\r\n", strlen("AT+QSSLCFG=\"https\",1\r\n"), 1000);
//	Delay(1000);
////    send_at_command("AT+QSSLCFG=\"httpsctxi\",1\r\n");
////    HAL_Delay(1000);
//    HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QSSLCFG=\"httpsctxi\",1\r\n", strlen("AT+QSSLCFG=\"httpsctxi\",1\r\n"), 1000);
//    Delay(1000);
//
//    // Send AT command to set the URL for HTTP GET request
//    char http_get_command[128];
//    sprintf(http_get_command, "AT+QHTTPURL=%d,60\r\n", strlen(firmware_url));
//    send_at_command(http_get_command);
//    Delay(1000);
//    send_at_command(firmware_url);
////    send_at_command("\n");
//    Delay(1000);
//
//    // Send AT command to initiate HTTP GET request
//    send_at_command("AT+QHTTPGET=60\r\n");
//    Delay(20000);
//    HAL_UART_Transmit(&huart2, (uint8_t *)"ATE0\r\n", strlen("ATE0\r\n"), 1000);
//
////    send_at_command("AT+QHTTPREAD=30\r\n");
//    HAL_UART_Transmit(&huart2, (uint8_t *)"AT+QHTTPREAD=30\r\n", strlen("AT+QHTTPREAD=30\r\n"), 1000);
//
//    // Wait for the HTTP response (you may need to implement proper response handling)
//    // Receive and store firmware data in the firmware_buffer
//    // You should implement logic to handle HTTP response and store data here.
//
//    // Example: Receive data until the end of HTTP response
//    uint8_t receive_buffer[256];
//    size_t bytes_received;
//    while (true) {
//        // Receive data from UART and get the number of bytes received
//        bytes_received = receive_data(receive_buffer, sizeof(receive_buffer));
//
//        // Check for the end of HTTP response and break if found
//        char* end_of_response = strstr((char*)receive_buffer, "\r\nOK\r\n");
//        if (end_of_response != NULL) {
//            // Calculate the length of the HTTP response data
//            size_t response_length = end_of_response - (char*)receive_buffer;
//
//            // Ensure that the firmware_buffer has enough space
//            if (firmware_size + response_length <= MAX_FIRMWARE_SIZE) {
//                // Copy received data to the firmware_buffer
//                memcpy(firmware_buffer + firmware_size, receive_buffer, response_length);
//                firmware_size += response_length;
//            } else {
//                // Firmware buffer is full, handle the error as needed
//                return false;
//            }
//
//            break; // End of HTTP response found
//        } else {
//            // Copy received data to the firmware_buffer
//            if (firmware_size + bytes_received <= MAX_FIRMWARE_SIZE) {
//                memcpy(firmware_buffer + firmware_size, receive_buffer, bytes_received);
//                firmware_size += bytes_received;
//            } else {
//                // Firmware buffer is full, handle the error as needed
//                return false;
//            }
//        }
//    }
//    // Check if firmware download was successful
//    if (firmware_size > 0) {
//        return true;
//    } else {
//        return false;
//    }
//}


bool download_firmware(const char* firmware_url) {
	bool result = false; // Default return value
    switch (current_state) {
        case INIT_HTTP:
            send_at_command("AT+QSSLCFG=\"https\",1", "OK");
            if (check_at_command_response(DELAY) == AT_RESPONSE_RECEIVED) {
            	send_at_command("AT+QSSLCFG=\"httpsctxi\",1", "OK");
//            	if (check_at_command_response(DELAY) == AT_RESPONSE_RECEIVED) {
            		Delay(1000);
            		current_state = SET_HTTP_URL;
            		firmware_download_busy = false;
//            	}
            } else if (check_at_command_response(LONG_DELAY) == AT_RESPONSE_TIMEOUT) {
                current_state = DOWNLOAD_ERROR;
//                firmware_download_busy = false;
            }
            break;

        case SET_HTTP_URL:
            char http_get_command[128];
            sprintf(http_get_command, "AT+QHTTPURL=%d,60", strlen(firmware_url));
            send_at_command(http_get_command, "CONNECT");
            Delay(1000);
//            send_at_command(firmware_url, "OK");
            UART_Send(firmware_url);
            Delay(1000);
            firmware_download_busy = false;
            current_state = INITIATE_HTTP_GET;
//            if (check_at_command_response(DELAY) == AT_RESPONSE_RECEIVED) {
//                current_state = INITIATE_HTTP_GET;
//                firmware_download_busy = false;
//            } else if (check_at_command_response(LONG_DELAY) == AT_RESPONSE_TIMEOUT) {
//                current_state = DOWNLOAD_ERROR;
////                firmware_download_busy = false;
//            }
            break;

