omkarsangrulkar/FOTA_GSM/STM32_M66/Core/Src/M66.c
        case INITIATE_HTTP_GET:
//        	Delay(1000);
//            send_at_command(firmware_url, "OK");
//        	UART_Send("AT+QHTTPGET=60");
//        	Delay(1000);
//        	current_state = RECEIVE_HTTP_RESPONSE;
            send_at_command("AT+QHTTPGET=60", "OK");
            if (check_at_command_response(DELAY) == AT_RESPONSE_RECEIVED) {
                current_state = RECEIVE_HTTP_RESPONSE;
                firmware_download_busy = false;
            } else if (check_at_command_response(LONG_DELAY) == AT_RESPONSE_TIMEOUT) {
                current_state = DOWNLOAD_ERROR;
//                firmware_download_busy = false;
            }
            break;


        case RECEIVE_HTTP_RESPONSE:
        	if (firmware_update_process()){
               	firmware_download_busy = false;
                current_state = DOWNLOAD_COMPLETE;
        	}
            break;


        case DOWNLOAD_COMPLETE:
            current_state = INIT_HTTP;  // Reset state for next time
            firmware_download_busy = false;
            result = true;
            break;

        case DOWNLOAD_ERROR:
//            current_state = INIT_HTTP;  // Reset for next time
//            firmware_download_busy = false;
            break;

        default:
            break;
    }
    return result;
}

// Verify firmware update with CRC
bool verify_firmware_update() {
    // Calculate the starting address of the firmware in flash
    uint8_t* firmware_data = (uint8_t*) START_FLASH_ADDRESS;

    // Calculate the length of the firmware data by excluding the CRC
    uint32_t firmware_length = current_flash_address - START_FLASH_ADDRESS - sizeof(uint32_t);

    // Ensure that the firmware length is valid
    if (!is_firmware_size_valid(firmware_length)) {
        return false;  // Firmware data length is invalid
    }

    // Address where the appended CRC is stored
    uint32_t* stored_crc_ptr = (uint32_t*)(START_FLASH_ADDRESS + firmware_length);

    // Calculate CRC for the stored firmware data
    uint32_t calculated_crc = calculate_crc32(firmware_data, firmware_length);

    // Compare the stored and calculated CRC values
    return (*stored_crc_ptr == calculated_crc);
}



bool is_firmware_size_valid(uint32_t firmware_length) {
    return firmware_length > sizeof(uint32_t);  // Ensure firmware_length is more than just the CRC size.
}

uint32_t extract_received_crc(uint8_t* firmware_data, uint32_t firmware_length) {
    uint32_t* crc_ptr = (uint32_t*)(firmware_data + firmware_length - sizeof(uint32_t));
    return *crc_ptr;
}


// Function to calculate CRC32 for a buffer
uint32_t calculate_crc32(uint8_t *data, uint32_t size) {
    uint32_t crc = 0xFFFFFFFF;

    for (uint32_t i = 0; i < size; i++) {
        crc ^= data[i];

        for (uint32_t j = 0; j < 8; j++) {
            if (crc & 0x00000001) {
                crc = (crc >> 1) ^ CRC_POLYNOMIAL;
            } else {
                crc = crc >> 1;
            }
        }
    }

    return ~crc;
}

bool write_firmware_to_flash(uint8_t* firmware_data, uint32_t firmware_length) {
    // Erase the entire TEMP sector
    HAL_StatusTypeDef status = HAL_FLASH_Unlock();
    if (status != HAL_OK) {
        // Handle flash unlock error
    	firmware_write_busy = false;
        return false;
    }

    FLASH_EraseInitTypeDef erase_info;
    erase_info.TypeErase = FLASH_TYPEERASE_SECTORS;
    erase_info.Sector = FLASH_SECTOR_10; // TEMP sector on STM32F4
    erase_info.NbSectors = 2;
    erase_info.VoltageRange = FLASH_VOLTAGE_RANGE_3; // Adjust voltage range as needed

    uint32_t error_sector;
    status = HAL_FLASHEx_Erase(&erase_info, &error_sector);
    if (status != HAL_OK) {
        // Handle flash erase error
        HAL_FLASH_Lock(); // Lock the flash memory before returning
        firmware_write_busy = false;
        return false;
    }

    // Program the firmware data into flash memory
    uint32_t* flash_address = (uint32_t*)TEMP_START_ADDR;
    uint32_t* firmware_data_ptr = (uint32_t*)firmware_data;

    for (size_t i = 0; i < firmware_length; i += 4) {
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, (uint32_t)flash_address, *firmware_data_ptr) != HAL_OK) {
            // Handle flash programming error
            HAL_FLASH_Lock(); // Lock the flash memory before returning
            firmware_write_busy = false;
            return false;
        }
        flash_address++;
        firmware_data_ptr++;
    }

    // Set the CONFIG flag after successfully writing firmware
    if (!set_update_flag()) {
        HAL_FLASH_Lock();
        firmware_write_busy = false;
        return false;
    }

    // Lock the flash memory after programming
    HAL_FLASH_Lock();
    firmware_write_busy = false;
    return true; // Return true to indicate success
}

bool set_update_flag(void) {
    if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, CONFIG_START_ADDR, UPDATE_FLAG_VALUE) != HAL_OK) {
        // Handle flash programming error
        HAL_FLASH_Lock(); // Lock the flash memory before returning
        return false;
    }
    return true;
}


void firmware_update_handler(void)
{
    switch (fwUpdateState)
    {
        case DOWNLOAD_PENDING:
            if (!firmware_download_busy) {
                firmware_download_busy = true; // Set the flag as we're initiating the download
                if (download_firmware(firmware_url)) {
                    fwUpdateState = VERIFY_PENDING;
                    resetAction();
                } else {
//                    firmware_download_busy = false; // Reset the flag if download fails

                }
            }
            break;

        case VERIFY_PENDING:
            if (!firmware_verify_busy) {
                firmware_verify_busy = true;
                if (verify_firmware_update()) {
                    fwUpdateState = WRITE_PENDING;
                    resetAction();
                } else {
//                    firmware_verify_busy = false; // Reset the flag if verification fails
                }
            }
            break;

