omkarsangrulkar/FOTA_GSM/STM32_M66/Core/Src/M66.c
        case WRITE_PENDING:
            if (!firmware_write_busy) {
                firmware_write_busy = true;
//                if (write_firmware_to_flash(firmware_buffer, firmware_size)) {
                    fwUpdateState = RESET_PENDING;
                    resetAction();
//                } else {
////                    firmware_write_busy = false; // Reset the flag if writing fails
//                }
            }
            break;

        case RESET_PENDING:
            NVIC_SystemReset();
            break;

        case ERROR_STATE:
            // Handle error, etc.
            // Reset all flags as we're in an error state
            firmware_download_busy = false;
            firmware_verify_busy = false;
            firmware_write_busy = false;
            break;

        default:
            /* IDLE, ACTION_IN_PROGRESS, or other states. No operation. */
            break;
    }
}

void resetAction() {
    retry_count = 0;
}

bool firmware_update_process() {
    // Attempt to erase flash
    if (HAL_OK != erase_flash(START_FLASH_ADDRESS, END_FLASH_ADDRESS)) {
        // Handle error: Erasing flash failed
        return false;
    }

    bool end_marker_found = false;
    bool first_marker_skipped = false;
    do {
        if (!read_request) {
            send_at_command("AT+QHTTPREAD=30\r\n", "CONNECT");
            while (check_at_command_response(LONG_DELAY) == AT_WAITING_RESPONSE);

            if (at_state != AT_RESPONSE_RECEIVED) {
                current_state = DOWNLOAD_ERROR;
                return false;
            }
            clear_uart_buffer();
            read_request = true;
        }

        // Read data until active buffer is full or END_MARKER is detected
        while (buffer_index < BUFFER_SIZE) {
            uint32_t bytes_received = receive_data(&active_buffer[buffer_index], BUFFER_SIZE - buffer_index);

            if (bytes_received == 0) {
                break;
            }

            buffer_index += bytes_received;


            if (find_end_marker(active_buffer, buffer_index)) {
//            	uint8_t *end_marker_pos = find_end_marker_position(active_buffer, buffer_index);
//                if (first_marker_skipped) {
//                    end_marker_found = true;
//                    buffer_index = (uint32_t)(find_end_marker_position(active_buffer, buffer_index) - active_buffer) + strlen(END_MARKER);
//                    // Switch buffers immediately
//                    uint8_t *temp = active_buffer;
//                    active_buffer = write_buffer;
//                    write_buffer = temp;
//
//                    // Write data to flash
//                    uint32_t residue = buffer_index % 4;
//                    uint32_t write_size = buffer_index - residue;
//                    if (HAL_OK != write_to_flash(current_flash_address, write_buffer, write_size)) {
//                        return false;
//                    }
//                    current_flash_address += write_size;
//                    buffer_index = residue;
//
//                    break;
//
//                } else {
//                    first_marker_skipped = true; // Skip this occurrence and continue processing
//                    // Switch buffers immediately
//                    uint8_t *temp = active_buffer;
//                    active_buffer = write_buffer;
//                    write_buffer = temp;
//
//                    // Write data to flash
//                    uint32_t residue = buffer_index % 4;
//                    uint32_t write_size = buffer_index - residue;
//                    if (HAL_OK != write_to_flash(current_flash_address, write_buffer, write_size)) {
//                        return false;
//                    }
//                    current_flash_address += write_size;
//                    buffer_index = residue;
//
//                    break;
//
//                }
                end_marker_found = true;
                buffer_index = (uint32_t)(find_end_marker_position(active_buffer, buffer_index) - active_buffer) + strlen(END_MARKER);
                // Switch buffers immediately
                uint8_t *temp = active_buffer;
                active_buffer = write_buffer;
                write_buffer = temp;

                // Write data to flash
                uint32_t residue = buffer_index % 4;
                uint32_t write_size = buffer_index - residue;
                if (HAL_OK != write_to_flash(current_flash_address, write_buffer, write_size)) {
                    return false;
                }
                current_flash_address += write_size;
                buffer_index = residue;

                break;


//                end_marker_found = true;
                // Adjust buffer_index to just after the end marker:
//                buffer_index = (uint32_t)(find_end_marker_position(active_buffer, buffer_index) - active_buffer) + strlen(END_MARKER);
            }

        }

        // Switch buffers
        uint8_t *temp = active_buffer;
        active_buffer = write_buffer;
        write_buffer = temp;

        // At this point, the write_buffer is full (or has END_MARKER), so write it to flash
        uint32_t residue = buffer_index % 4;
        uint32_t write_size = buffer_index - residue;
        if (HAL_OK != write_to_flash(current_flash_address, write_buffer, write_size)) {
            return false;
        }
        current_flash_address += write_size;

        if (residue) {
            memmove(write_buffer, &write_buffer[write_size], residue);
        }

        buffer_index = residue;

    } while (!end_marker_found);
    current_state = DOWNLOAD_COMPLETE;
    return true; // Firmware update was successful
}
	bool find_end_marker(uint8_t *buffer, uint32_t size) {
		for (uint32_t i = 0; i < size - strlen(END_MARKER) + 1; i++) {
			if (memcmp(&buffer[i], END_MARKER, strlen(END_MARKER)) == 0) {
				return true;
			}
		}
		return false;
	}

HAL_StatusTypeDef erase_flash(uint32_t start_address, uint32_t end_address) {
    HAL_StatusTypeDef status;
    FLASH_EraseInitTypeDef erase;
    uint32_t error;

    // Unlock the flash
   status = HAL_FLASH_Unlock();
   if (status != HAL_OK) {
       // Handle flash unlock error
   	firmware_write_busy = false;
       return status;
   }

    // Define the erase parameters
    erase.TypeErase = FLASH_TYPEERASE_SECTORS;
    erase.VoltageRange = FLASH_VOLTAGE_RANGE_3; // Adjust according to your needs
    erase.Sector = get_flash_sector(start_address); // You need to implement the get_flash_sector function
    erase.NbSectors = get_flash_sector(end_address) - erase.Sector + 1;

    status = HAL_FLASHEx_Erase(&erase, &error);
    if (status != HAL_OK) {
        // Handle flash unlock error
    	firmware_write_busy = false;
        return status;
    }

    // Lock the flash
    HAL_FLASH_Lock();
    if (status != HAL_OK) {
        // Handle flash unlock error
    	firmware_write_busy = false;
        return status;
    }

