omkarsangrulkar/FOTA_GSM/STM32_M66/Core/Src/M66.c
    return status;
}

HAL_StatusTypeDef write_to_flash(uint32_t address, uint8_t *data, uint32_t length) {
    HAL_StatusTypeDef status;

    // Unlock the flash
    status = HAL_FLASH_Unlock();
    if (status != HAL_OK) {
        // Handle flash unlock error
    	firmware_write_busy = false;
        return status;
    }

    for (uint32_t i = 0; i < length; i += 4) {
        status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address + i, *(uint32_t*)(data + i));
        if (status != HAL_OK) {
        	firmware_write_busy = false;
            return status;
        }
    }

    // Lock the flash
    status = HAL_FLASH_Lock();
    if (status != HAL_OK) {
    	firmware_write_busy = false;
    	return status;
    }

    return status;
}

uint32_t get_flash_sector(uint32_t address) {
    uint32_t sector;

    // STM32F407VG flash sectors
    if (address <= 0x08004000) sector = FLASH_SECTOR_0;
    else if (address <= 0x08008000) sector = FLASH_SECTOR_1;
    else if (address <= 0x0800C000) sector = FLASH_SECTOR_2;
    else if (address <= 0x08010000) sector = FLASH_SECTOR_3;
    else if (address <= 0x08020000) sector = FLASH_SECTOR_4;
    else if (address <= 0x08040000) sector = FLASH_SECTOR_5;
    else if (address <= 0x08060000) sector = FLASH_SECTOR_6;
    else if (address <= 0x08080000) sector = FLASH_SECTOR_7;
    else if (address <= 0x080A0000) sector = FLASH_SECTOR_8;
    else if (address <= 0x080C0000) sector = FLASH_SECTOR_9;
    else if (address <= 0x080E0000) sector = FLASH_SECTOR_10;
    else sector = FLASH_SECTOR_11;  // covers up to 0x08100000

    return sector;
}

void clear_uart_buffer() {
    uart_buffer.write_index = 0;
    uart_buffer.read_index = 0;
}

uint8_t* find_end_marker_position(uint8_t *buffer, uint32_t size) {
    for (uint32_t i = 0; i < size - strlen(END_MARKER) + 1; i++) {
        if (memcmp(&buffer[i], END_MARKER, strlen(END_MARKER)) == 0) {
            return &buffer[i]; // Return pointer to the starting position of END_MARKER
        }
    }
    return NULL; // END_MARKER not found in the buffer
}



